import { IPeriod } from '../src/types/interfaces';

export const data: IPeriod[] = [
  {
    period: [1960, 1964],
    title: 'История',
    facts: [
      {
        year: 1960,
        content:
          '24 октября - катастрофа на космодроме Байконур. Погибло 78 человек',
      },
      {
        year: 1961,
        content:
          '12 апреля — первый полёт человека в космос, который совершил Юрий Алексеевич Гагарин',
      },
      {
        year: 1962,
        content:
          '27 октября — апогей Карибского кризиса («Чёрная суббота»)',
      },
      {
        year: 1963,
        content:
          '22 ноября — в Далласе убит 35-й президент США Джон Кеннеди',
      },
      {
        year: 1964,
        content:
          '5 апреля произошёл военный переворот в Бразилии',
      },
    ],
  },
  {
    period: [1965, 1969],
    title: 'Музыка',
    facts: [
      {
        year: 1985,
        content:
          'В Абингдоне, графство Оксфордшир была основана группа Radiohead',
      },
      {
        year: 1986,
        content:
          '23 января — состоялась первая церемония включения выдающихся музыкантов в Зал Славы Рок-н-ролла',
      },
      {
        year: 1987,
        content: 'С появлением группы Nirvana началась эпоха гранжа',
      },
      {
        year: 1988,
        content:
          'В СССР начала свою карьеру поэтесса и автор-исполнитель Янка Дягилева',
      },
      {
        year: 1989,
        content:
          '22 сентября - умер Ирвинг Берлин, замечательный музыкант и композитор, автор множества джазовых стандартов',
      },
    ],
  },
  {
    period: [1990, 1994],
    title: 'Кино',
    facts: [
      {
        year: 1990,
        content:
          '15 апреля - родилась британская актриса, прославившаяся благодаря роли Гермионы Грейнджер в экранизации серии книг «Гарри Поттер»',
      },
      {
        year: 1991,
        content:
          '1 июля - премьера фильма Джеймса Кэмерона «Терминатор 2: Судный день»',
      },
      {
        year: 1992,
        content:
          '«Молчание ягнят» стало первым фильмом ужасов, получившим «Оскар» за лучший фильм',
      },
      {
        year: 1993,
        content:
          'Вышел на большие экраны анимационный фильм «Кошмар перед рождеством» совместного производства Генри Селика и Тима Бёртона',
      },
      {
        year: 1994,
        content:
          '21 мая - премьера кинокартины Квентина Тарантино «Криминальное чтиво»',
      },
    ],
  },
  {
    period: [1995, 1999],
    title: 'Технологии',
    facts: [
      {
        year: 1995,
        content:
          '24 августа - в розничную продажу поступила операционная система Windows 95',
      },
      {
        year: 1996,
        content:
          'Ноябрь - в Японии состоялся выпуск первых массовых DVD-дисков и проигрывателей',
      },
      {
        year: 1997,
        content:
          '7 мая — компания «Intel» официально представила микропроцессор Pentium II',
      },
      {
        year: 1998,
        content:
          '7 сентября — в США Ларри Пейджем, Сергеем Брином основана компания Google',
      },
      {
        year: 1999,
        content:
          'Сформулирована концепция «Интернета вещей» (IoT). Под этим термином понимается система взаимосвязанных устройств, оснащённых датчиками, программным обеспечениеми и т.д.',
      },
    ],
  },
];
