import { IPeriod } from '../src/types/interfaces';

export const data: IPeriod[] = [
  {
    period: [1960, 1964],
    title: 'История',
    facts: [
      {
        year: 1960,
        content:
          '24 октября - катастрофа на космодроме Байконур. Погибло 78 человек',
      },
      {
        year: 1961,
        content:
          '12 апреля — первый полёт человека в космос, который совершил Юрий Алексеевич Гагарин',
      },
      {
        year: 1962,
        content:
          '27 октября — апогей Карибского кризиса («Чёрная суббота»)',
      },
      {
        year: 1963,
        content:
          '22 ноября — в Далласе убит 35-й президент США Джон Кеннеди',
      },
      {
        year: 1964,
        content:
          '5 апреля произошёл военный переворот в Бразилии',
      },
    ],
  },
  {
    period: [1965, 1969],
    title: 'Музыка',
    facts: [
      {
        year: 1965,
        content:
          '2 сентября - записаны студийные версии первых песен группы The Doors',
      },
      {
        year: 1966,
        content:
          '5 августа - выход альбома Revolver группы the Beatles',
      },
      {
        year: 1967,
        content: '12 мая - выход дебютного альбома группы the Jimi Hendrix Experience знаменует собой расцвет психоделического рока',
      },
      {
        year: 1968,
        content:
          '25 октября - Led Zeppelin дали свой первый концерт в Университете графства Суррей',
      },
      {
        year: 1969,
        content:
          '16 августа - умер Марк Бернес, советский эстрадный певец и актёр',
      },
    ],
  },
  {
    period: [1970, 1974],
    title: 'Кино',
    facts: [
      {
        year: 1970,
        content:
          'Выход картины Бернардо Бертолуччи - «Конформист»',
      },
      {
        year: 1971,
        content:
          '19 декабря - премьера фильма Стэнли Кубрика «Заводной апельсин»',
      },
      {
        year: 1972,
        content:
          '14 марта - мировая премьера фильма «Крёстный отец»',
      },
      {
        year: 1973,
        content:
          '28 декабря — скончались Александр Роу, советский кинорежиссёр, автор множества фильмов-сказок',
      },
      {
        year: 1974,
        content:
          '21 мая - премьера кинокартины Квентина Тарантино «Криминальное чтиво»',
      },
    ],
  },
  {
    period: [1995, 1999],
    title: 'Технологии',
    facts: [
      {
        year: 1995,
        content:
          '24 августа - в розничную продажу поступила операционная система Windows 95',
      },
      {
        year: 1996,
        content:
          'Ноябрь - в Японии состоялся выпуск первых массовых DVD-дисков и проигрывателей',
      },
      {
        year: 1997,
        content:
          '7 мая — компания «Intel» официально представила микропроцессор Pentium II',
      },
      {
        year: 1998,
        content:
          '7 сентября — в США Ларри Пейджем, Сергеем Брином основана компания Google',
      },
      {
        year: 1999,
        content:
          'Сформулирована концепция «Интернета вещей» (IoT). Под этим термином понимается система взаимосвязанных устройств, оснащённых датчиками, программным обеспечениеми и т.д.',
      },
    ],
  },
];
